print("Hello", 22.3, 5,)
print("\n")
print("Hi friend", 5.5, 5, sep=", ", end=". ")
print("\n\tHello")
print("John\'s book")

#Математика
print(5 + 5) # +, -, *, /
print(-5.5 % 5)
print(2 ** 3)
print(min(5, 11, 25, 36, 2))
print(max(205, 35, 0, 104))
print(abs(-3))
print(pow(5, 6))
print(round(25.6))

#отримання значення
input("My name..")

# sum() - сума елементів
# max() - найбільше значення
# min() - найменше значення
# len() - довжина списку / рядка
# sorted() - повертає відсортований список
# reversed()  перевертає порядок
# abs() - модуль числа
# round() - округлення

# Для роботи з циклами
# range() — створює послідовність чисел
# enumerate() — дає індекс + значення
# zip() — об'єднує кілька списків

# Перевірки
# any() — True якщо хоча б один елемент True
# all() — True якщо всі елементи True

# Для перетворення типів
# int()
# float()
# str()
# list()
# tuple()
# set()

# Трошки цікавіші
# type() — показує тип змінної
# id() — унікальний ідентифікатор об'єкта
# dir() — показує методи об'єкта
# help() — довідка